---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.IsValid(Autodesk.Revit.DB.Element)
source: html/0e2a45b1-c04d-280b-bd73-588a7370245e.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.IsValid Method

Checks if the element is a valid alignment station label.

## Syntax (C#)
```csharp
public static bool IsValid(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to validate.